<?php

define('kotodamaArray', array(
	"ア" => "土",
	"イ" => "土",
	"ウ" => "土",
	"エ" => "土",
	"オ" => "土",
	"カ" => "木",
	"キ" => "木",
	"ク" => "木",
	"ケ" => "木",
	"コ" => "木",
	"ガ" => "木",
	"ギ" => "木",
	"グ" => "木",
	"ゲ" => "木",
	"ゴ" => "木",
	"サ" => "金",
	"シ" => "金",
	"ス" => "金",
	"セ" => "金",
	"ソ" => "金",
	"ザ" => "金",
	"ジ" => "金",
	"ズ" => "金",
	"ゼ" => "金",
	"ゾ" => "金",
	"タ" => "火",
	"チ" => "火",
	"ツ" => "火",
	"テ" => "火",
	"ト" => "火",
	"ダ" => "火",
	"ヂ" => "火",
	"ヅ" => "火",
	"デ" => "火",
	"ド" => "火",
	"ナ" => "火",
	"ニ" => "火",
	"ヌ" => "火",
	"ネ" => "火",
	"ノ" => "火",
	"ハ" => "水",
	"ヒ" => "水",
	"フ" => "水",
	"ヘ" => "水",
	"ホ" => "水",
	"バ" => "水",
	"ビ" => "水",
	"ブ" => "水",
	"ベ" => "水",
	"ボ" => "水",
	"パ" => "水",
	"ピ" => "水",
	"プ" => "水",
	"ペ" => "水",
	"ポ" => "水",
	"マ" => "水",
	"ミ" => "水",
	"ム" => "水",
	"メ" => "水",
	"モ" => "水",
	"ヤ" => "土",
	"ユ" => "土",
	"ヨ" => "土",
	"ラ" => "火",
	"リ" => "火",
	"ル" => "火",
	"レ" => "火",
	"ロ" => "火",
	"ワ" => "土",
	"ヲ" => "土",
	"ン" => "土",
	"" => "土"
));

define('soukakuLuckArray', array(
	"m" => array(                                                 //男性用
		"凶", "吉", "凶", "吉", "凶", "吉", "吉", "吉", "吉", "凶", // 0- 9画
		"凶", "吉", "凶", "吉", "凶", "吉", "吉", "吉", "吉", "凶", //10-19画
		"凶", "吉", "凶", "吉", "吉", "吉", "凶", "凶", "凶", "吉", //20-29画
		"凶", "吉", "吉", "吉", "凶", "吉", "凶", "吉", "吉", "吉", //30-39画
		"凶", "吉", "凶", "凶", "凶", "吉", "凶", "吉", "吉", "凶", //40-49画
		"凶", "凶", "吉", "凶", "凶", "凶", "凶", "吉", "吉", "凶", //50-59画
		"凶", "吉", "凶", "吉", "凶", "吉", "凶", "吉", "吉", "凶", //60-69画
		"凶", "吉", "凶", "凶", "凶", "凶", "凶", "凶", "凶", "凶", //70-79画
		"凶", "吉", "凶", "吉", "吉"                                //80-84画
	),
	"f" => array(                                                 //女性用
		"凶", "吉", "凶", "吉", "凶", "吉", "吉", "吉", "吉", "凶", // 0- 9画
		"凶", "吉", "凶", "吉", "凶", "吉", "吉", "吉", "吉", "凶", //10-19画
		"凶", "凶", "凶", "凶", "吉", "凶", "凶", "凶", "凶", "凶", //20-29画
		"凶", "吉", "吉", "凶", "凶", "吉", "凶", "吉", "吉", "吉", //30-39画
		"凶", "吉", "凶", "凶", "凶", "吉", "凶", "吉", "吉", "凶", //40-49画
		"凶", "凶", "吉", "凶", "凶", "凶", "凶", "吉", "吉", "凶", //50-59画
		"凶", "吉", "凶", "吉", "凶", "吉", "凶", "吉", "吉", "凶", //60-69画
		"凶", "吉", "凶", "凶", "凶", "凶", "凶", "凶", "凶", "凶", //70-79画
		"凶", "吉", "凶", "吉", "吉"                                //80-84画
	)
));

define('synastryLuckArray', array(
	"木" => array("木"=> "吉", "火"=> "大吉", "土"=>"凶", "金"=>"大凶", "水"=> "吉"),
	"火" => array("木"=> "吉", "火"=> "吉", "土"=> "大吉", "金"=>"凶", "水"=>"大凶"),
	"土" => array("木"=>"大凶", "火"=> "吉", "土"=> "吉", "金"=> "大吉", "水"=>"凶"),
	"金" => array("木"=>"凶", "火"=>"大凶", "土"=> "吉", "金"=> "吉", "水"=> "大吉"),
	"水" => array("木"=> "大吉", "火"=>"凶", "土"=>"大凶", "金"=> "吉", "水"=> "吉")
));

define('gogyoTranslationArray', array(
	"-" => array(
		"id"=>0, "ja"=>"-", "en"=>"-", "fr"=>"-",
		"enComment"=>"Couldn't find a fortune name."
	),
	"木" => array(
		"id"=>1, "ja"=>"木", "en"=>"Wood", "fr"=>"Bois",
		"enComment"=>"Represents growth, flexibility, health."
	),
	"火" => array(
		"id"=>2, "ja"=>"火", "en"=>"Fire", "fr"=>"Feu",
		"enComment"=>"Represents passion, energy, purification."
	),
	"土" => array(
		"id"=>3, "ja"=>"土", "en"=>"Earth", "fr"=>"Terre",
		"enComment"=>"Represents foundation, stability, rebirth."
	),
	"金" => array(
		"id"=>4, "ja"=>"金", "en"=>"Metal", "fr"=>"Métal",
		"enComment"=>"Represents courage, leadership, justice."
	),
	"水" => array(
		"id"=>5, "ja"=>"水", "en"=>"Water", "fr"=>"Eau",
		"enComment"=>"Represents wisdom, versatility, receptivity."
	),
	"大吉" => array("id"=> 2, "ja"=>"大吉", "en"=>"Great Fortune", "fr"=>"Grande Fortune"),
	"吉"   => array("id"=> 1, "ja"=>"吉", "en"=>"Fortune", "fr"=>"Fortune"),
	"凶"   => array("id"=>-1, "ja"=>"凶", "en"=>"Misfortune", "fr"=>"Malheur"),
	"大凶" => array("id"=>-2, "ja"=>"大凶", "en"=>"Bad Fortune", "fr"=>"Mauvais Fortune")
));

?>
