<?php

///// 英語→ローマ字変換用 /////
// '/原語/': 小文字で登録
define('english2romajiArray1', array(
	'/^mac/', '/^mc/', '/jr$/', //特殊読み
	'/^x([iy])/', '/^x([aueo])/', //音便: 語頭「x」時
	'/ce$/', '/ge$/', '/a([^aiueoy])e$/', '/[iy]([^aiueoy])e$/', '/u([^aiueoy])e$/', '/e([^aiueoy])e$/', '/o([^aiueoy])e$/', //音便: 語尾「e」時
	'/ca([^aiueoyr])/', '/ga([^aiueoyr])/', '/ci([^aiueoy])/', '/ce([^aiueoy])/', //音便:「ca」「ga」「ci」「ce」
	'/([^aiueoy]|^)er([^aiueoy]|$)/', '/([^aiueoy]|^)ur([^aiueoy]|$)/', '/([^aiueoy]|^)ow([^aiueoy]|$)/', '/([^aiueoy]|^)ie([^aiueoy]|$)/', '/([^aiueoy]|^)ou([^aiueoy]|$)/', //長母音(ア)
	'/([^aiueoy]|^)ea([^aiueoy]|$)/', '/([^aiueoy]|^)ee([^aiueoy]|$)/', //長母音(イ)
	'/([^aiueoy]|^)oo([^aiueoy]|$)/', '/([^aiueoy]|^)ue([^aiueoy]|$)/', '/([^aiueoy]|^)ew([^aiueoy]|$)/', //長母音(ウ)
	'/([^aiueoy]|^)al([kl])/', '/([^aiueoy]|^)au([^aiueoy]|$)/', '/([^aiueoy]|^)aw([^aiueoy]|$)/', '/([^aiueoy]|^)oe([^aiueoy]|$)/', '/([^aiueoy]|^)or([^aiueoy]|$)/', //長母音(オ)
	'/a/', '/e/', '/i/', '/o/', '/u/', //短母音
	
	'/^kn/', '/^gn/', '/^wr/', '/^ps/', '/([^^])gh/', '/bt$/', '/mb$/', //サイレントレター
	'/([bdfgjkrvwz])h/', '/ch/', '/sh/', '/ph/', '/th/', '/ck/', '/([a-z])\1/', //子音の重なり
	'/([^AIUEO])([AIUEO])([dkpqtx])$/', //語尾「短母音+子音」時の促音
	'/b([AIUEOYy])/', '/c([AIUEOYy])/', '/d([AIUEOYy])/', '/f([AIUEOYy])/', '/g([AIUEOYy])/',
	'/h([AIUEOYy])/', '/j([AIUEOYy])/', '/k([AIUEOYy])/', '/l([AIUEOYy])/', '/m([AIUEOYy])/', 
	'/n([AIUEOYy])/', '/p([AIUEOYy])/', '/q([AIUEOYy])/', '/r([AIUEOYy])/', '/s([AIUEOYy])/', 
	'/t([AIUEOYy])/', '/v([AIUEOYy])/', '/w([AIUEOYy])/', '/x([AIUEOYy])/', '/y([AIUEO])/', '/z([AIUEOYy])/', //子音+母音
	'/b/', '/c/', '/d/', '/f/', '/g/', '/h/', '/j/', '/k/', '/l/', '/m/', '/n/', 
	'/p/', '/q/', '/r/', '/s/', '/t/', '/v/', '/w/', '/x/', '/y/', '/z/'//単子音
));

// 'ローマ字': 大文字で登録
define('english2romajiArray2', array(
	'MAKU', 'MAKU', 'JUNIA', //特殊読み
	'ZAI', 'z\1', //音便: 語頭「x」時
	'se', 'je', 'EI\1', 'AI\1', 'YU\1', 'II\1', 'OU\1', //音便: 語尾「e」時
	'KYA\1', 'GYA\1', 'SI\1', 'SE\1', //音便: 「ca」「ga」「ci」「ce」
	'\1AA\2', '\1AA\2', '\1AWA\2', '\1AI\2', '\1AU\2', //長母音(ア)
	'\1II\2', '\1II\2', //長母音(イ)
	'\1UU\2', '\1UU\2', '\1YUU\2', //長母音(ウ)
	'\1OU\2', '\1OU\2', '\1OU\2', '\1OU\2', '\1OU\2', //長母音(オ)
	'A', 'E', 'I', 'O', 'A', //短母音
	
	'n', 'n', 'r', 's', '\1', 'TO', 'MU', //サイレントレター
	'\1', 'ty', 'sy', 'f', 's', 'k', '\1', //子音の重なり
	'\1\2XTU\3', //語尾「短母音+子音」時の促音
	'B\1', 'K\1', 'D\1', 'F\1', 'G\1', 
	'H\1', 'J\1', 'K\1', 'R\1', 'M\1', 
	'N\1', 'P\1', 'KUW\1', 'R\1', 'S\1', 
	'T\1', 'B\1', 'W\1', 'KUS\1', 'Y\1', 'Z\1', //子音+母音
	'BU', 'KU', 'DO', 'FU', 'GU', 'A', 'JI', 'KU', 'RU', 'MU', 'N', 
	'PU', 'KU', 'A', 'SU', 'TO', 'BU', 'U', 'KUSU', 'I', 'ZU' //単子音
));


///// ローマ字→カナ変換用 /////
//'/ローマ字/': 大文字で登録
define('romaji2kanaArray1', array(
	'/-/', '/XTU/', 
	'/BYA/', '/BYI/', '/BYU/', '/BYE/', '/BYO/', 
	'/DYA/', '/DYI/', '/DYU/', '/DYE/', '/DYO/', 
	'/FYA/', '/FYI/', '/FYU/', '/FYE/', '/FYO/', 
	'/GYA/', '/GYI/', '/GYU/', '/GYE/', '/GYO/', 
	'/HYA/', '/HYI/', '/HYU/', '/HYE/', '/HYO/', 
	'/JYA/', '/JYI/', '/JYU/', '/JYE/', '/JYO/', 
	'/KYA/', '/KYI/', '/KYU/', '/KYE/', '/KYO/', 
	'/MYA/', '/MYI/', '/MYU/', '/MYE/', '/MYO/', 
	'/NYA/', '/NYI/', '/NYU/', '/NYE/', '/NYO/', 
	'/PYA/', '/PYI/', '/PYU/', '/PYE/', '/PYO/', 
	'/RYA/', '/RYI/', '/RYU/', '/RYE/', '/RYO/', 
	'/SYA/', '/SYI/', '/SYU/', '/SYE/', '/SYO/', 
	'/TYA/', '/TYI/', '/TYU/', '/TYE/', '/TYO/', 
	'/WYA/', '/WYI/', '/WYU/', '/WYE/', '/WYO/', 
	'/ZYA/', '/ZYI/', '/ZYU/', '/ZYE/', '/ZYO/', 
	'/BA/', '/BI/', '/BU/', '/BE/', '/BO/', 
	'/DA/', '/DI/', '/DU/', '/DE/', '/DO/', 
	'/FA/', '/FI/', '/FU/', '/FE/', '/FO/', 
	'/GA/', '/GI/', '/GU/', '/GE/', '/GO/', 
	'/HA/', '/HI/', '/HU/', '/HE/', '/HO/', 
	'/JA/', '/JI/', '/JU/', '/JE/', '/JO/', 
	'/KA/', '/KI/', '/KU/', '/KE/', '/KO/', 
	'/MA/', '/MI/', '/MU/', '/ME/', '/MO/', 
	'/NA/', '/NI/', '/NU/', '/NE/', '/NO/', 
	'/PA/', '/PI/', '/PU/', '/PE/', '/PO/', 
	'/RA/', '/RI/', '/RU/', '/RE/', '/RO/', 
	'/SA/', '/SI/', '/SU/', '/SE/', '/SO/', 
	'/TA/', '/TI/', '/TU/', '/TE/', '/TO/', 
	'/WA/', '/WI/', '/WU/', '/WE/', '/WO/', 
	'/YA/', '/YI/', '/YU/', '/YE/', '/YO/', 
	'/ZA/', '/ZI/', '/ZU/', '/ZE/', '/ZO/', 
	'/N/', '/A/', '/I/', '/U/', '/E/', '/O/'
));
	
//'カナ'
define('romaji2kanaArray2', array(
	'ー', 'ッ', 
	'ビャ', 'ビ', 'ビュ', 'ビェ', 'ビョ',   //BY
	'ヂャ', 'ヂィ', 'ヂュ', 'ヂェ', 'ヂョ', //DY
	'フャ', 'フィ', 'フュ', 'フェ', 'フョ', //FY
	'ギャ', 'ギ', 'ギュ', 'ギェ', 'ギョ',   //GY
	'ヒャ', 'ヒ', 'ヒュ', 'ヒェ', 'ヒョ',   //HY
	'ジャ', 'ジ', 'ジュ', 'ジェ', 'ジョ',   //JY
	'キャ', 'キ', 'キュ', 'キェ', 'キョ',   //KY
	'ミャ', 'ミ', 'ミュ', 'ミェ', 'ミョ',   //MY
	'ニャ', 'ニ', 'ニュ', 'ニェ', 'ニョ',   //NY
	'ピャ', 'ピ', 'ピュ', 'ピェ', 'ピョ',   //PY
	'リャ', 'リ', 'リュ', 'リェ', 'リョ',   //RY
	'シャ', 'シ', 'シュ', 'シェ', 'ショ',   //SY
	'チャ', 'チ', 'チュ', 'チェ', 'チョ',   //TY
	'イャ', 'ウィ', 'イュ', 'ウェ', 'イョ', //WY
	'ジャ', 'ジ', 'ジュ', 'ジェ', 'ジョ',   //ZY
	'バ', 'ビ', 'ブ', 'ベ', 'ボ',           //B
	'ダ', 'ヂ', 'ヅ', 'デ', 'ド',           //D
	'ファ', 'フィ', 'フ', 'フェ', 'フォ',   //F
	'ガ', 'ギ', 'グ', 'ゲ', 'ゴ',           //G
	'ハ', 'ヒ', 'フ', 'ヘ', 'ホ',           //H
	'ジャ', 'ジ', 'ジュ', 'ジェ', 'ジョ',   //J
	'カ', 'キ', 'ク', 'ケ', 'コ',           //K
	'マ', 'ミ', 'ム', 'メ', 'モ',           //M
	'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',           //N
	'パ', 'ピ', 'プ', 'ペ', 'ポ',           //P
	'ラ', 'リ', 'ル', 'レ', 'ロ',           //R
	'サ', 'シ', 'ス', 'セ', 'ソ',           //S
	'タ', 'チ', 'ツ', 'テ', 'ト',           //T
	'ワ', 'ウィ', 'ウ', 'ウェ', 'オ',       //W
	'ヤ', 'イ', 'ユ', 'エ', 'ヨ',           //Y
	'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ',           //Z
	'ン', 'ア', 'イ', 'ウ', 'エ', 'オ'
));

///// カナ→カナ変換用(漢字候補未発見時対策) /////
//'/カナ/'
define('kana2kanaArray1', array(
	'/ー/', '/ァ/', '/ィ/', '/ゥ/', '/ェ/', '/ォ/', '/ッ/', '/ャ/', '/ュ/', '/ョ/', '/ヰ/', '/ヱ/', '/ヲ/', '/ン/', //対応漢字0個
	'/ヂ/', '/ヅ/', '/パ/', '/ピ/', '/プ/', '/ペ/', '/ポ/', '/レ/',                                                 //対応漢字0個
	'/ゼ/', '/ゾ/', '/ベ/',                                                                                         //対応漢字1個
	'/ザ/', '/デ/', '/テ/', '/ヘ/',                                                                                 //対応漢字2個
	'/グ/', '/ラ/', '/ル/'                                                                                          //対応漢字3個
));

//'カナ'
define('kana2kanaArray2', array(
	'', 'ア', 'イ', 'ウ', 'エ', 'オ', '', 'ヤ', 'ユ', 'ヨ', 'イ', 'エ', 'オ', 'ム', 
	'ジ', 'ズ', 'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'レイ', 
	'セ', 'ソ', 'ヘ', 
	'サ', 'テ', 'テイ', 'ヘイ', 
	'ク', 'ラン', 'リュウ'
));

?>
